//
//  PrivacyAndTermsTexts.swift
//  MicroLoansApp
//
//  Created by Дмитрий Пономарев on 26.01.2024.
//

import Foundation

extension String {
    static let privacyPolicyText = """
    Petrilla Technologies, Llc разработала приложение Микрозаймы - Займы на карту как бесплатное приложение. Этот СЕРВИС предоставляется компанией Petrilla Technologies, Llc безвозмездно и предназначен для использования "как есть".
    
    Эта страница предназначена для информирования посетителей о наших политиках в отношении сбора, использования и раскрытия Личной Информации, если кто-либо решит использовать наш Сервис.
    
    Если вы решите использовать наш Сервис, вы соглашаетесь на сбор и использование информации в соответствии с этой политикой. Личная информация, которую мы собираем, используется для предоставления и улучшения Сервиса. Мы не будем использовать или делиться вашей информацией с кем-либо, кроме как описано в этой Политике Конфиденциальности.
    
    Термины, используемые в этой Политике Конфиденциальности, имеют то же значение, что и в наших Условиях использования, которые доступны в Микрозаймы - Займы на карту, если не определено иначе в этой Политике Конфиденциальности.
    
    Сбор и Использование Информации
    
    Для лучшего опыта использования нашего Сервиса мы можем требовать от вас предоставить определенную личную информацию. Информация, которую мы запрашиваем, будет сохранена нами и использована как описано в этой политике конфиденциальности.
    
    Приложение использует сторонние сервисы, которые могут собирать информацию, используемую для вашей идентификации.
    
    Ссылка на политику конфиденциальности сторонних поставщиков услуг, используемых приложением:
    
    Facebook
    One Signal
    Adjust
    Данные Журнала
    
    Мы хотим проинформировать вас о том, что при использовании нашего Сервиса в случае ошибки в приложении мы собираем данные и информацию (через продукты третьих сторон) на вашем телефоне, называемые Данными Журнала. Эти Данные Журнала могут включать информацию, такую как ваш IP-адрес устройства, название устройства, версия операционной системы, конфигурация приложения при использовании нашего Сервиса, время и дата использования Сервиса и другие статистические данные.
    
    Cookies
    
    Cookies – это файлы с небольшим количеством данных, которые обычно используются как анонимные уникальные идентификаторы. Они отправляются в ваш браузер с веб-сайтов, которые вы посещаете, и сохраняются во внутренней памяти вашего устройства.
    
    Этот Сервис явно не использует эти «cookies». Однако приложение может использовать сторонний код и библиотеки, которые используют «cookies» для сбора информации и улучшения своих услуг. У вас есть возможность принять или отклонить эти cookies и знать, когда cookie отправляется на ваше устройство. Если вы решите отказаться от наших cookies, вы можете не иметь возможности использовать некоторые части этого Сервиса.
    
    Поставщики Услуг
    
    Мы можем привлекать сторонние компании и частных лиц по следующим причинам:
    
    Для облегчения нашего Сервиса;
    Для предоставления Сервиса от нашего имени;
    Для выполнения услуг, связанных с Сервисом; или
    Для помощи нам в анализе того, как используется наш Сервис.
    Мы хотим проинформировать пользователей этого Сервиса о том, что эти третьи стороны имеют доступ к их Личной Информации. Причина в том, что им нужно выполнять задачи, порученные им от нашего имени. Однако они обязаны не раскрывать или использовать информацию в каких-либо других целях.
    
    Безопасность
    
    Мы ценим ваше доверие в предоставлении нам вашей Личной Информации, поэтому мы стремимся использовать коммерчески приемлемые средства для ее защиты. Но помните, что ни один метод передачи данных через интернет, или метод электронного хранения не является на 100% безопасным и надежным, и мы не можем гарантировать его абсолютную безопасность.
    
    Ссылки на Другие Сайты
    
    Этот Сервис может содержать ссылки на другие сайты. Если вы нажмете на ссылку третьей стороны, вы будете направлены на этот сайт. Обратите внимание, что эти внешние сайты не управляются нами. Поэтому мы настоятельно рекомендуем вам ознакомиться с Политикой Конфиденциальности этих веб-сайтов. Мы не контролируем и не несем ответственности за содержание, политики конфиденциальности или практики любых сторонних сайтов или услуг.
    
    Конфиденциальность Детей
    
    Эти Услуги не адресованы лицам младше 13 лет. Мы не собираем сознательно личную информацию от детей младше 13 лет. В случае, если мы узнаем, что ребенок младше 13 лет предоставил нам личную информацию, мы немедленно удаляем ее с наших серверов. Если вы являетесь родителем или опекуном и знаете, что ваш ребенок предоставил нам личную информацию, пожалуйста, свяжитесь с нами, чтобы мы могли предпринять необходимые действия.
    
    Изменения в Этой Политике Конфиденциальности
    
    Мы можем обновлять нашу Политику Конфиденциальности время от времени. Поэтому вам рекомендуется периодически просматривать эту страницу на предмет изменений. Мы уведомим вас о любых изменениях, опубликовав новую Политику Конфиденциальности на этой странице.
    
    Эта политика действует с 25.01.2024."
    
    Свяжитесь с Нами
    
    Если у вас есть какие-либо вопросы или предложения относительно нашей Политики Конфиденциальности, не стесняйтесь обращаться к нам по адресу support@microzayminakartu.com.
    """
    
    static let termsOfUserText = """
    Условия для оформления кредита:
    – Минимальный срок кредитования: 2 месяца
    – Максимальный срок кредитования: 1 год
    – Минимальная сумма по кредиту: 10 000 рублей
    – Максимальная сумма по кредиту: 3 000 000 рублей
    – Минимальная годовая процентная ставка: 1%
    – Максимальная годовая процентная ставка (APR): 32%
    – Минимальный возраст для получения кредита: 18 лет
    – Максимальный возраст для получения кредита: 85 лет
    – Необходимость наличия паспорта гражданина Российской Федерации.

    Условия и положения:
    Скачивая или используя приложение, вы автоматически соглашаетесь с этими условиями – поэтому убедитесь, что вы внимательно прочитали их перед использованием приложения. Вам не разрешается копировать или модифицировать приложение, любую его часть или наши товарные знаки каким-либо образом. Вам не разрешается пытаться извлечь исходный код приложения, а также не следует пытаться перевести приложение на другие языки или создавать производные версии. Само приложение, а также все товарные знаки, авторские права, права на базы данных и другие права интеллектуальной собственности, связанные с ним, по-прежнему принадлежат Petrilla Technologies, Llc.

    Petrilla Technologies, Llc стремится к тому, чтобы приложение было как можно более полезным и эффективным. По этой причине мы оставляем за собой право вносить изменения в приложение или взимать плату за его услуги в любое время и по любой причине. Мы никогда не будем взимать с вас плату за приложение или его услуги, не указав вам точно, за что вы платите.

    Приложение Микрозаймы - Займы на карту хранит и обрабатывает личные данные, которые вы нам предоставили, чтобы предоставлять наш Сервис. Вы обязаны обеспечить безопасность своего телефона и доступа к приложению. Поэтому мы рекомендуем вам не делать jailbreak или root вашего телефона, что является процессом удаления программных ограничений и ограничений, наложенных официальной операционной системой вашего устройства. Это может сделать ваш телефон уязвимым для вредоносных программ/вирусов/вредоносных программ, нарушить функции безопасности вашего телефона и может означать, что приложение Микрозаймы - Займы на карту не будет работать должным образом или вообще не будет работать.

    Приложение использует сторонние услуги, которые заявляют свои Условия и положения.

    Ссылка на Условия и положения сторонних поставщиков услуг, используемых приложением:

    Facebook
    One Signal
    Adjust
    Вы должны знать, что есть определенные вещи, за которые Petrilla Technologies, Llc не будет нести ответственность. Некоторые функции приложения будут требовать от приложения наличия активного интернет-соединения. Соединение может быть Wi-Fi или предоставлено вашим мобильным оператором, но Petrilla Technologies, Llc не может нести ответственность за то, что приложение не работает с полной функциональностью, если у вас нет доступа к Wi-Fi, и у вас не осталось лимита данных.

    Если вы используете приложение за пределами зоны с Wi-Fi, вы должны помнить, что условия договора с вашим мобильным оператором все еще применяются. В результате ваш мобильный оператор может взимать с вас плату за стоимость данных на время подключения при доступе к приложению или другие платежи третьих сторон. Используя приложение, вы принимаете на себя ответственность за любые такие платежи, включая плату за роуминг данных, если вы используете приложение за пределами вашей домашней территории (т.е. региона или страны) без отключения роуминга данных. Если вы не плательщик счетов за устройство, на котором вы используете приложение, пожалуйста, имейте в виду, что мы предполагаем, что вы получили разрешение от плательщика счетов на использование приложения.

    Таким образом, Petrilla Technologies, Llc не всегда может нести ответственность за то, как вы используете приложение, т.е. вы должны убедиться, что ваше устройство остается заряженным - если оно разрядится и вы не сможете включить его для использования Сервиса, Petrilla Technologies, Llc не может принять ответственность.

    Что касается ответственности Petrilla Technologies, Llc за ваше использование приложения, когда вы используете приложение, важно помнить, что, хотя мы стремимся к тому, чтобы оно всегда было обновлено и корректно, мы полагаемся на сторонние стороны для предоставления нам информации, чтобы мы могли сделать ее доступной для вас. Petrilla Technologies, Llc не принимает на себя ответственность за любые прямые или косвенные потери, которые вы испытываете в результате полного доверия этой функциональности приложения.

    В какой-то момент мы можем пожелать обновить приложение. Приложение в настоящее время доступно на iOS – требования к системе (и для любых дополнительных систем, которые мы решим расширить доступность приложения) могут измениться, и вам нужно будет скачать обновления, если вы хотите продолжать использовать приложение. Petrilla Technologies, Llc не обещает, что всегда будет обновлять приложение так, чтобы оно было актуально для вас и/или работало с версией iOS, которую вы установили на своем устройстве. Тем не менее, вы обещаете всегда принимать обновления приложения, когда они вам предлагаются, Мы также можем пожелать прекратить предоставление приложения и прекратить использование его в любое время без предварительного уведомления о прекращении вам. Если мы не сообщим вам иное, после любого прекращения (а) права и лицензии, предоставленные вам по этим условиям, прекращаются; (б) вы должны прекратить использование приложения и (при необходимости) удалить его с вашего устройства.

    Изменения в этих Условиях и положениях

    Мы можем время от времени обновлять наши Условия и положения. Таким образом, вам рекомендуется периодически просматривать эту страницу на предмет изменений. Мы уведомим вас о любых изменениях, опубликовав новые Условия и положения на этой странице.

    Эти условия и положения действуют с 25.01.2024.

    Свяжитесь с нами

    Если у вас есть вопросы или предложения относительно наших Условий и положений, не стесняйтесь обращаться к нам по адресу support@microzayminakartu.com.
"""
}
